[GraphicalObject]
Name=FrptSel
Path=
Title=
WndStyle=TOOLBAR
PosStyle=FIXED
X=0
Y=0
Width=1300
Height=38
FrameThickness=0
Activate=0
EraseBk=0
Set0=
RC-DLL=HPCor008.DLL

[ToolDescriptor]
1 = SelectNewSection , NonEditComboBox, HPGWCT02.DLL
2 = ZoomInWindow , PUSHBUTTON , hpgbut02.dll
3 = ZoomOutWindow , PUSHBUTTON , hpgbut02.dll
4 = pointer , RADIOBUTTON , hpgbut02.dll
5 = graphic , RADIOBUTTON , hpgbut02.dll
6 = table , RADIOBUTTON , hpgbut02.dll
7 = text , RADIOBUTTON , hpgbut02.dll
8 = number , RADIOBUTTON , hpgbut02.dll
9 = pagebreak , RADIOBUTTON , hpgbut02.dll
10 = pagesize , STATIC , HPGWCT02.DLL

[NonEditComboBox SelectNewSection]
DefCommand=FRptSelection
TextList=
MaxListSize=16
Enable=1
BKColor=255,255,255
TextColor=0,0,0
HelpList=Select section to insert
DefCMDParNumber=0
x=5
y=8
width=285
height=130
Command=
Help=セクションの挿入
Font=ＭＳ Ｐゴシック,9,normal
FrameThickness=2

[PushButton ZoomInWindow]
ImageList=RBMP.ZoomIn|RBMP.ZoomIn_Down|RBMP.ZoomIn_Disable|
x=305
y=3
width=32
height=32
Command=FRPT_Zoom 1
Help=スクリーンのレポート レイアウト サイズを拡大します
FrameThickness=2

[PushButton ZoomOutWindow]
ImageList=RBMP.ZoomOut|RBMP.ZoomOut_Down|RBMP.ZoomOut_Disable|
x=337
y=3
width=32
height=32
Command=FRPT_Zoom -1
Help=スクリーンのレポート レイアウト サイズを縮小します
FrameThickness=2

[RadioButton pointer]
ImageList=RBMP.ArrowSelect|RBMP.ArrowSelect_Down|RBMP.ArrowSelect||
Group= -1
x=389
y=3
width=32
height=32
Command=FRPT_SelectTool 0
Help=選択ツール
FrameThickness=2

[RadioButton graphic]
ImageList=RBMP.FReportGraphic|RBMP.FReportgraphic_Down|RBMP.FReportgraphic||
Group= -1
x=421
y=3
width=32
height=32
Command=FRPT_SelectTool 2
Help=グラフィック ツール
FrameThickness=2

[RadioButton table]
ImageList=RBMP.FReporttable|RBMP.FReporttable_Down|RBMP.FReporttable||
Group= -1
x=453
y=3
width=32
height=32
Command=FRPT_SelectTool 3
Help=テーブル ツール
FrameThickness=2

[RadioButton text]
ImageList=RBMP.FReporttext|RBMP.FReporttext_Down|RBMP.FReporttext||
Group= -1
x=485
y=3
width=32
height=32
Command=FRPT_SelectTool 1
Help=テキスト ツール
FrameThickness=2

[RadioButton number]
ImageList=RBMP.FReportnumber|RBMP.FReportnumber_Down|RBMP.FReportnumber||
Group= -1
x=517
y=3
width=32
height=32
Command=FRPT_SelectTool 5
Help=ナンバー ツール
FrameThickness=2

[RadioButton pagebreak]
ImageList=RBMP.FReportpagebreak|RBMP.FReportpagebreak_Down|RBMP.FReportpagebreak||
Group= -1
x=549
y=3
width=32
height=32
Command=FRPT_SelectTool 4
Help=ページ区切りツール
FrameThickness=2

[STATIC pagesize]
Text1=
Enable=1
x=650
y=13
width=70
height=17
Help=現在のプリンタ設定、マージン、ヘッダー、フッター サイズにおける印刷可能な範囲
FrameThickness=0
Justify=Center
TextColor=0,0,255
